Look-up-the-sky/External-LCD-STM32f070-/App/Modbus.c
/********************************************************
 * 版权：苏州欧姆尼克新能源科技有限公司软件组
 * 文件名称：modbus.c
 * 修改人：沈仕强
 * 修改日期：2019.06.20
 * 描述：modbus函数
 *******************************************************/
#include "config.h"
#include "MF_Datecfg.h"
#include "HF_Datecfg.h"
#include "modbus.h"
#include "stm32f0xx_usart.h"
#include "Crc.h"
#include "Variable_Transformation.h"
#include "Led_State.h"


INT8U PRJ_NUMBER = Default_Model;//默认为0，通过通讯自动判定  
modbus_info_t modbus;
INT32U c_1MS_Cnt;
INT32U Timeout_Cnt = 0;
INT8U UART_RX_RUNNING_FLAG = 0;
//INT8U UART2_RX_RUNNING_FLAG = 0;
INT16U PUSDATE_BUF[128];
//INT8U  Uart2_Receive_BUF[20];
//INT16U Uart2_Receive_Len;  //接收长度
//**************modbus任务标志位*************
INT8U FLAG_03_UPDATE = 1;
INT8U FLAG_04_UPDATE = 0;
INT8U FLAG_06_UPDATE = 0;
INT8U FLAG_10_UPDATE = 0;
INT8U FINISH_FLAG = 0;
INT8U CRC_Error_Flag = 0;
INT8U Read_Write_Change_Flag = 0;
INT8U LCD_IAP_Updata_Flag = 0;    //LCD屏升级信号
//INT8U Uart2_Receive_Finish_Flag = 0;
//INT8U Uart2_Receiving_Flag = 0;
//**************globle*****************
WRITE_06_DATE write_06_date;
WRITE_10_DATE write_10_date;
INT8U Auto_Identify[8] = {0x01,0x04,0x00,0x00,0x00,0x02,0x71,0xCB};
INT8U Set_Enable[13] = {0x01,0x10,0x20,0x00,0x00,0x02,0x04,0x45,0x41,0x53,0x54,0x12,0x79};
INT8U Country_Enable[13] = {0x01,0x10,0x21,0x02,0x00,0x02,0x04,0x45,0x41,0x53,0x54,0x9e,0x30};
INT8U Inv_Reset_Enable[13] = {0x01,0x10,0x21,0x06,0x00,0x02,0x04,0x52,0x45,0x43,0x46,0x56,0x7b};
INT8U History_Clear_Enable[13] = {0x01,0x10,0x21,0x09,0x00,0x02,0x04,0x48,0x43,0x4C,0x52,0xf4,0xdd};
INT8U PV_Mode_Enable[13] = {0x01,0x10,0x21,0x0c,0x00,0x02,0x04,0x4d,0x4f,0x44,0x45,0xb3,0xe3};
INT8U Total_Generation_En[13] = {0x01,0x10,0x21,0x0f,0x00,0x02,0x04,0x45,0x43,0x4f,0x4d,0x37,0x63};
INT8U Inv_Fast_Control_En[13] = {0x01,0x10,0x21,0x12,0x00,0x02,0x04,0x45,0x53,0x45,0x54,0x31,0x59};


void MODBUS_UART1_IRQHandler(void)
{
	
	if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)		//数据接收中断
	{
		if(UART_RX_RUNNING_FLAG == 0)
		{
			UART_RX_RUNNING_FLAG = 1;
			modbus.prevtime = c_1MS_Cnt;
		}
		/*超过最长MODBUS缓冲 丢弃*/
		if(modbus.recvlen >= MAX_RCVBUF_LEN )
		{
			modbus.modbus_rcv_buf[0]=USART1->RDR ;
			modbus.recvlen = 0;
			return;
		}
		Comm_StateFlag--;   //通讯计数，用来判断与逆变器通讯是否中断
		if(Comm_StateFlag != 0)
		{
			Comm_StateFlag = 0;
		}
		modbus.modbus_rcv_buf[modbus.recvlen++]=USART_ReceiveData(USART1);
		if((modbus.modbus_rcv_buf[0] == 0x01)&&(modbus.modbus_rcv_buf[1] == 0x10)&&(modbus.modbus_rcv_buf[2] == 0x70)
			&&(modbus.modbus_rcv_buf[3] == 0x00)&&(modbus.modbus_rcv_buf[4] == 0x00)&&(modbus.modbus_rcv_buf[5] == 0x02)
			&&(modbus.modbus_rcv_buf[6] == 0x04)&&(modbus.modbus_rcv_buf[7] == 0x49)&&(modbus.modbus_rcv_buf[8] == 0x41)
			&&(modbus.modbus_rcv_buf[9] == 0x50)&&(modbus.modbus_rcv_buf[10] == 0x45))
		{
			LCD_IAP_Updata_Flag = 1;   //升级信号判断
		}
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
	}
	

}

//void MODBUS_UART2_IRQHandler(void)
//{
//		if(USART_GetITStatus(USART2,USART_IT_RXNE)!=RESET)        
//	   {
//			 Uart2_Receive_BUF[Uart2_Receive_Len++]=USART_ReceiveData(USART2);
//			 USART_ClearITPendingBit(USART2, USART_IT_RXNE);
//			 Uart2_Receiving_Flag = 1;
//	   }	 
//		else if((USART_GetFlagStatus(USART2,USART_FLAG_IDLE)!=RESET)&&(Uart2_Receiving_Flag == 1))
//			{					
//				USART_ClearFlag(USART2, USART_FLAG_IDLE);						
//				Uart2_Receive_Finish_Flag = 1;
//				Uart2_Receiving_Flag = 0;
//      }	
//			else
//			{
//				USART_ClearFlag(USART2, USART_FLAG_IDLE);	
//			}
//	
//}

//***********************************发送函数**********************************
void MODBUS_UARTSend(USART_TypeDef* USARTx, INT8U *BufferPtr, INT32U Length)
{
	RS485_DIR1_OUT();
	while ( Length != 0 )
		{
			USART_SendData(USARTx, (unsigned char)*BufferPtr);
			while( USART_GetFlagStatus(USARTx,USART_FLAG_TC) == RESET);
			BufferPtr++;
			Length--;
		}
	Comm_StateFlag++;   //通讯计数，用来判断与逆变器通讯是否中断
	RS485_DIR1_IN();
}



void sModbusTask(void)
{
	static unsigned char CNT = 0,First_Flag =0,Second_Flag =0;
	INT16U cur_cnt,offset;
	//01 10 70 00 00 02 04 49 41 50 45 2d d6
	if(LCD_IAP_Updata_Flag == 1)  //判断升级信号
	{
		
		/* Clear All pending flags */
		FLASH_ClearFlag( FLASH_FLAG_BSY|FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGERR);
		FLASH_Unlock();
		FLASH_ErasePage(FLAG_FLASH_ADDRESS);
		if(FLASH_ProgramWord(FLAG_FLASH_ADDRESS,APP_TO_BOOT) == FLASH_COMPLETE)
		{	
			FLASH_Lock();
			__set_PRIMASK(1);
			NVIC_SystemReset();
		}
	}
	else if(PRJ_NUMBER == Default_Model) //用于启动判断是黄蜂还是蜜蜂机型
	{	
			Auto_Identify_M();
			if(FINISH_FLAG == 1)
			{
				if((modbus.modbus_rcv_buf[3] == 0x45)&&(modbus.modbus_rcv_buf[4] == 0x41)
					&&(modbus.modbus_rcv_buf[5] == 0x53)&&(modbus.modbus_rcv_buf[6] == 0x54))
				{
					PRJ_NUMBER = SUNNYBEE;
				}
				else if((modbus.modbus_rcv_buf[3] == 0x48)&&(modbus.modbus_rcv_buf[4] == 0x52)
					&&(modbus.modbus_rcv_buf[5] == 0x4E)&&(modbus.modbus_rcv_buf[6] == 0x54))
				{
					PRJ_NUMBER = HORNET;
				}
				else
				{
					PRJ_NUMBER = Default_Model;
				}
			}		
	}
	else
	{
		if(FLAG_06_UPDATE == 1)
		{
			Read_Write_Change_Flag =1;
			FLAG_03_UPDATE = 0;
			FLAG_04_UPDATE = 0;
			FLAG_06_UPDATE = 0;
			//write_06_update(0x01,write_06_date.usStartAddr,write_06_date.usLen);
		}
		else
		{
			if(FLAG_10_UPDATE == 1)
			{
				Read_Write_Change_Flag = 1;
				FLAG_03_UPDATE = 0;
				FLAG_04_UPDATE = 0;
				
				if(PRJ_NUMBER == SUNNYBEE)
				{
					if(First_Flag == 0)
					{
						First_Flag = 1;
						memcpy(modbus.modbus_snd_buf,Set_Enable,13);
						MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
						UART_RX_RUNNING_FLAG = 0;
					}
					else
					{
						if((UART_RX_RUNNING_FLAG == 1)&&(First_Flag == 1)&&(Second_Flag == 0))
						{
							cur_cnt = c_1MS_Cnt;
							offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
							if(offset < MAX_RCV_PERIOD)
							return;
							Second_Flag =1;
							if((write_10_date.usStartAddr == 0x2104)||(write_10_date.usStartAddr == 0x2105))
							{
								memcpy(modbus.modbus_snd_buf,Country_Enable,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							if(write_10_date.usStartAddr == 0x2108)
							{
								memcpy(modbus.modbus_snd_buf,Inv_Reset_Enable,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							if(write_10_date.usStartAddr == 0x210b)
							{
								memcpy(modbus.modbus_snd_buf,History_Clear_Enable,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							if(write_10_date.usStartAddr == 0x210e)
							{
								memcpy(modbus.modbus_snd_buf,PV_Mode_Enable,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							if(write_10_date.usStartAddr == 0x2111)
							{
								memcpy(modbus.modbus_snd_buf,Total_Generation_En,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							if(write_10_date.usStartAddr >=0x2114)
							{
								memcpy(modbus.modbus_snd_buf,Inv_Fast_Control_En,13);
								MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, 13);
							}
							UART_RX_RUNNING_FLAG = 0;
							modbus.recvlen = 0;
						}
						else
						{
							if((UART_RX_RUNNING_FLAG == 1)&&(First_Flag == 1)&&(Second_Flag == 1))
							{
									cur_cnt = c_1MS_Cnt;
									offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
									if(offset < MAX_RCV_PERIOD)
									return;
									write_10_update(0x01,write_10_date.usStartAddr,write_10_date.usLen);
									UART_RX_RUNNING_FLAG =0;
									if(FINISH_FLAG == 1)
									{
										FLAG_03_UPDATE = 1;
										CNT = 0;
										FLAG_10_UPDATE = 0;
										First_Flag = 0;
										Second_Flag = 0;
									}
									else
									{
										if(CRC_Error_Flag ==1)
										{
											CRC_Error_Flag =0;
											First_Flag = 0;
											Second_Flag = 0;
										}
									}
							}							
						}
					}
				}
				else if(PRJ_NUMBER == HORNET)
				{
					write_10_update(0x01,write_10_date.usStartAddr,write_10_date.usLen);
					if(FINISH_FLAG == 1)
					{
						FLAG_03_UPDATE = 1;
						CNT = 0;
						FLAG_10_UPDATE = 0;
					}
				}
			}
			else
			{
				if(FLAG_03_UPDATE == 1)
				{
						switch(CNT)
						{
							case 0:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_03_update(0x01,0x2000, 0x0c);
								else if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x2080, 0x03);						
								if(FINISH_FLAG ==1)
								{
									CNT = 1;
								}
							
