Look-up-the-sky/External-LCD-STM32f070-/App/Modbus.c
							}
							break;
							case 1:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_03_update(0x01,0x2100, 0x25);
								else if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x2100, 0x30);
								if(FINISH_FLAG ==1)
								{
									CNT = 2;
								}
							}
							break;
							case 2:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_03_update(0x01,0x2125, 0x33);
								else if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x2202, 0x04);
								if(FINISH_FLAG ==1)
								{
									if(PRJ_NUMBER == SUNNYBEE)
									{
										System_Time_Change_Flag = 1; //系统时间改变标志位
										CNT = 0;
										Read_Write_Change_Flag = 1;
										FLAG_04_UPDATE = 1;
										FLAG_03_UPDATE = 0;   //开机询问一次
									}
									else if(PRJ_NUMBER == HORNET)
									{
										CNT = 3;
									}
								}
							}
							break;
							case 3:
							{
								if(PRJ_NUMBER == HORNET)
								  read_03_update(0x01,0x2280, 0x08);
								if(FINISH_FLAG ==1)
								{
									CNT = 4;
								}
							}
							break;
							case 4:
							{
								if(PRJ_NUMBER == HORNET)
								read_03_update(0x01,0x2300, 0x0B);
								if(FINISH_FLAG ==1)
								{
									CNT = 5;
								}
							}
							break;
							case 5:
							{
								if(PRJ_NUMBER == HORNET)
								read_03_update(0x01,0x2300, 0x3B);
								if(FINISH_FLAG ==1)
								{
									CNT = 6;
								}
							}
							break;
							case 6:
							{
								if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x233B, 0x41);
								if(FINISH_FLAG ==1)
								{
									CNT = 7;
								}
							}
							break;
							case 7:
							{
								if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x238F, 0x54);
								if(FINISH_FLAG ==1)
								{
									CNT = 8;
								}
							}
							break;
							case 8:
							{
								if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x2480, 0x13);
								if(FINISH_FLAG ==1)
								{
									System_Time_Change_Flag = 1; //系统时间改变标志位
									CNT = 0;
									Read_Write_Change_Flag = 1;
									FLAG_04_UPDATE = 1;
									FLAG_03_UPDATE = 0;   //开机询问一次
								}
							}
							default:
								{
								if(CNT > 8)
									CNT = 0;
								}
								break;
						}
				}
				else
				{
					if(FLAG_04_UPDATE == 1)  //定时更新
					{
						switch(CNT)
						{
							case 0:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_03_update(0x01,0x7006, 0x01);   //询问IAP升级状态
								else if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x7006, 0x01);   //询问IAP升级状态			
								if(FINISH_FLAG ==1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
										CNT = 1;									
								}
							}
								break;
							case 1:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_03_update(0x01,0x2119, 0x01);   //询问开关机状态
								else if(PRJ_NUMBER == HORNET)
									read_03_update(0x01,0x2287, 0x01);   //询问开关机状态			
								if(FINISH_FLAG ==1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 2;
								}
							}
								break;
							case 2:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_04_update(0x01,0x0000,0x61);
								else if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0000,0x61);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 3;
								}
							}
								break;
							case 3:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_04_update(0x01,0x0100,0x35);
								else if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0100,0x07);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 6;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 4;
								}
							}
								break;
							case 4:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_04_update(0x01,0x0200,0x1c);
								else if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0180,0x10);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 5;
								}
							}
								break;
							case 5:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_04_update(0x01,0x0BB8,0x50);
								else if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0200,0x1A);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 8;
									}
									else
									CNT = 6;
								}
							}
								break;
							case 6:
							{
								if(PRJ_NUMBER == SUNNYBEE)
									read_04_update(0x01,0x0FA0,0x21);
								else if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0280,0x0F);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 7;
								}
							}
								break;
							case 7:
							{
								if(PRJ_NUMBER == SUNNYBEE)
								{
									read_04_update(0x01,0x1004,0x1b);
									if(FINISH_FLAG == 1)
									{
										if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
										CNT = 0;
									}
								}
								else if(PRJ_NUMBER == HORNET)
								{
									read_04_update(0x01,0x0300,0x64);
									if(FINISH_FLAG == 1)
									{
										if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
										{
											if(PRJ_NUMBER == SUNNYBEE)
												CNT = 3;
											else if(PRJ_NUMBER == HORNET)
												CNT = 5;
										}
										else
										CNT = 8;
									}
								}
							}
								break;
							case 8:
							{
								if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x0FA0,0x21);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 9;
								}
							}
								break;
							case 9:
							{
								if(PRJ_NUMBER == HORNET)
									read_04_update(0x01,0x1004,0x1b);
								if(FINISH_FLAG == 1)
								{
									if((Italy_SelfTest_Flag >= 1)&&(Italy_SelfTest_Flag <= 8))
									{
										if(PRJ_NUMBER == SUNNYBEE)
											CNT = 3;
										else if(PRJ_NUMBER == HORNET)
											CNT = 5;
									}
									else
									CNT = 0;
								}
							}
								break;
							default:
							{
								if(CNT >9)
									CNT = 0;
							}
								break;
						}				
					}
				}
			}
		}
	}
}
void Auto_Identify_M()   //自动识别机型函数
{
	static INT8U SEND_Auto_FLAG = 0;
	INT16U cur_cnt,offset;
	INT16U crc,RX_CRC;
	if(SEND_Auto_FLAG == 0)                //询问指令未发送
	{

		//01 04 00 00 00 02 71 CB 
		MODBUS_UARTSend(USART1,Auto_Identify,8);
		SEND_Auto_FLAG = 1;
		modbus.recvlen = 0;
		FINISH_FLAG = 0;
	}
	else                                      //询问指令发送完成，等待接收
	{
		Timeout_Cnt++;
		if(Timeout_Cnt > 5)      //防止同逆变器一起上电，导致询问后永远等待逆变器回应
		{
			Timeout_Cnt = 0;
			SEND_Auto_FLAG = 0;
		}
		if(UART_RX_RUNNING_FLAG == 1)
		{
			cur_cnt = c_1MS_Cnt;
			offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
			if(offset < MAX_RCV_PERIOD)
			return;
			//接收完成，更新数据    
			UART_RX_RUNNING_FLAG = 0;
			crc = crc16(modbus.modbus_rcv_buf,modbus.recvlen-MODBUS_CRC_LEN);
			/*CRC校验错误丢弃*/
			RX_CRC = (modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN])|(modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN+1]<<8);
			if(RX_CRC != crc)
			{
				modbus.recvlen = 0;
				SEND_Auto_FLAG = 0;//失败则继续询问
				return;
			}
			SEND_Auto_FLAG = 0;
			modbus.recvlen = 0;
			FINISH_FLAG =1;
			Timeout_Cnt = 0;
		}
	}
}
void read_03_update(INT8U ID,INT16U usStartAddr, INT16U usLen)
{	
	static INT8U SEND_03_FLAG = 0;
	INT16U cur_cnt,offset;
	INT16U rlen,crc,RX_CRC;
	modbus_holdreg_r_req r_req;
	if(Read_Write_Change_Flag ==1)
	{
		SEND_03_FLAG = 0;
		Read_Write_Change_Flag = 0;
	}
	if(SEND_03_FLAG == 0)                //询问指令未发送
	{
		modbus.recvlen = 0;
		r_req.ID = ID;
		r_req.func = 0x03;
		r_req.addr = __REV16(usStartAddr);
		r_req.size = __REV16(usLen);
		rlen = sizeof(modbus_holdreg_r_req);
		memcpy(modbus.modbus_snd_buf,&r_req,rlen);
		*(INT16U*)(&modbus.modbus_snd_buf[rlen]) = crc16(modbus.modbus_snd_buf,rlen);
		MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, rlen+MODBUS_CRC_LEN);
		SEND_03_FLAG = 1;
		FINISH_FLAG = 0;
	}
	else                                      //询问指令发送完成，等待接收
	{
		Timeout_Cnt++;
		if(Timeout_Cnt > 5)      //防止同逆变器一起上电，导致询问后永远等待逆变器回应
		{
			Timeout_Cnt = 0;
			SEND_03_FLAG = 0;
		}
		if(UART_RX_RUNNING_FLAG == 1)
		{
			cur_cnt = c_1MS_Cnt;
			offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
			if(offset < MAX_RCV_PERIOD)
			return;
			//接收完成，更新数据
			UART_RX_RUNNING_FLAG = 0;
			crc = crc16(modbus.modbus_rcv_buf,modbus.recvlen-MODBUS_CRC_LEN);
			/*CRC校验错误丢弃*/
			RX_CRC = (modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN])|(modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN+1]<<8);
			if(RX_CRC != crc)
			{
				modbus.recvlen = 0;
				SEND_03_FLAG = 0;//失败则继续询问
				FLAG_03_UPDATE = 1;
				return;
			}
			memcpy(PUSDATE_BUF,&modbus.modbus_rcv_buf[3],(modbus.recvlen-MODBUS_CRC_LEN-3));
			if(PRJ_NUMBER == SUNNYBEE)
				CFG_ParamCfg(g_astrParamCfgTblAttr, PUSDATE_BUF, usStartAddr, usLen);//写入MF参数
			else if(PRJ_NUMBER == HORNET)
				CFG_ParamCfg(HF_astrParamCfgTblAttr, PUSDATE_BUF, usStartAddr, usLen);//写入HF参数
			modbus.recvlen = 0;	
			SEND_03_FLAG = 0;
			FINISH_FLAG = 1;
			Timeout_Cnt = 0;
		}
	}
	
	
