Look-up-the-sky/External-LCD-STM32f070-/App/Modbus.c
}
void read_04_update(INT8U ID,INT16U usStartAddr, INT16U usLen)
{
	static INT8U SEND_04_FLAG = 0;
	INT16U cur_cnt,offset;
	INT16U rlen,crc,RX_CRC;
	modbus_inputreg_r_req r_req;
	if(Read_Write_Change_Flag ==1)
	{
		SEND_04_FLAG = 0;
		Read_Write_Change_Flag = 0;
	}
	if(SEND_04_FLAG == 0)                //询问指令未发送
	{
		r_req.ID = ID;
		r_req.func = 0x04;
		r_req.addr = __REV16(usStartAddr);
		r_req.size = __REV16(usLen);
		rlen = sizeof(modbus_inputreg_r_req);
		memcpy(modbus.modbus_snd_buf,&r_req,rlen);
		*(INT16U*)(&modbus.modbus_snd_buf[rlen]) = crc16(modbus.modbus_snd_buf,rlen);
		MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, rlen+MODBUS_CRC_LEN);
		SEND_04_FLAG = 1;
		modbus.recvlen = 0;
		FINISH_FLAG = 0;
	}
	else                                      //询问指令发送完成，等待接收
	{
		Timeout_Cnt++;
		if(Timeout_Cnt > 5)      //防止同逆变器一起上电，导致询问后永远等待逆变器回应
		{
			Timeout_Cnt = 0;
			SEND_04_FLAG = 0;
		}
		if(UART_RX_RUNNING_FLAG == 1)
		{
			cur_cnt = c_1MS_Cnt;
			offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
			if(offset < MAX_RCV_PERIOD)
			return;
			//接收完成，更新数据    
			UART_RX_RUNNING_FLAG = 0;
			crc = crc16(modbus.modbus_rcv_buf,modbus.recvlen-MODBUS_CRC_LEN);
			/*CRC校验错误丢弃*/
			RX_CRC = (modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN])|(modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN+1]<<8);
			if(RX_CRC != crc)
			{
				modbus.recvlen = 0;
				SEND_04_FLAG = 0;//失败则继续询问
				FLAG_04_UPDATE = 1;
				return;
			}
			memcpy(PUSDATE_BUF,&modbus.modbus_rcv_buf[3],(modbus.recvlen-MODBUS_CRC_LEN-3));
			if(PRJ_NUMBER == SUNNYBEE)
				CFG_ParamCfg(g_astrParamSendTblAttr, PUSDATE_BUF, usStartAddr, usLen);//写入MF参数
			else if(PRJ_NUMBER == HORNET)
				CFG_ParamCfg(HF_astrParamSendTblAttr, PUSDATE_BUF, usStartAddr, usLen);//写入HF参数
			SEND_04_FLAG = 0;
			modbus.recvlen = 0;
			FINISH_FLAG =1;
	
		}
	}
}

//void write_06_update(INT8U ID,INT16U usStartAddr, INT16U usLen)
//{
//	static INT8U SEND_06_FLAG = 0;
//	INT16U cur_cnt,offset;
//	INT16U rlen,crc,RX_CRC;
//	modbus_holdreg_ws_req ws_req;
//	if(SEND_06_FLAG == 0)         //写参数信息未发送
//	{
//		modbus.recvlen = 0;
//		ws_req.ID = ID;
//		ws_req.func = 0x06;
//		ws_req.addr = __REV16(usStartAddr);
//		if(PRJ_NUMBER == SUNNYBEE)
//				CFG_LoadParam(PUSDATE_BUF, g_astrParamCfgTblAttr, usStartAddr,usLen, 0x03); //MF参数读取
//		else if(PRJ_NUMBER == HORNET)
//				CFG_LoadParam(PUSDATE_BUF, HF_astrParamCfgTblAttr, usStartAddr,usLen, 0x03); //HF参数读取
//		ws_req.value = PUSDATE_BUF[0];
//		rlen = sizeof(modbus_holdreg_ws_req);
//		memcpy(modbus.modbus_snd_buf,&ws_req,rlen);
//		*(INT16U*)(&modbus.modbus_snd_buf[rlen]) = crc16(modbus.modbus_snd_buf,rlen);
//		MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, rlen+MODBUS_CRC_LEN);
//		SEND_06_FLAG = 1;
//	}
//	else                            //发送完成，等待接收回复
//	{
//		Timeout_Cnt++;
//		if(Timeout_Cnt > 5)      //防止同逆变器一起上电，导致询问后永远等待逆变器回应
//		{
//			Timeout_Cnt = 0;
//			SEND_06_FLAG = 0;
//		}
//		if(UART_RX_RUNNING_FLAG == 1)
//		{
//			cur_cnt = c_1MS_Cnt;
//			offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
//			if(offset < MAX_RCV_PERIOD)
//			return;
//			//接收完成，判断是否写入成功
//			UART_RX_RUNNING_FLAG = 0;
//			crc = crc16(modbus.modbus_rcv_buf,modbus.recvlen-MODBUS_CRC_LEN);
//			/*CRC校验错误丢弃*/
//			RX_CRC = (modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN])|(modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN+1]<<8);
//			if(RX_CRC != crc)
//			{
//				modbus.recvlen = 0;
//				return;
//			}
//		}
//		modbus.recvlen = 0;
//	}
//}
//	
void write_10_update(INT8U ID,INT16U usStartAddr, INT16U usLen)
{
	static INT8U SEND_10_FLAG = 0;
	INT16U cur_cnt,offset;
	INT16U rlen,crc,RX_CRC;
	modbus_holdreg_wm_req wm_req;
	if(SEND_10_FLAG == 0)         //写参数信息未发送
	{
		modbus.recvlen = 0;
		FINISH_FLAG = 0;
		wm_req.ID = ID;
		wm_req.func = 0x10;
		wm_req.addr = __REV16(usStartAddr);	
		wm_req.size = __REV16(usLen);
		wm_req.bytes = usLen*2;
		if(PRJ_NUMBER == SUNNYBEE)
				CFG_LoadParam(PUSDATE_BUF, g_astrParamCfgTblAttr, usStartAddr,usLen, 0x03); //MF参数读取
		else if(PRJ_NUMBER == HORNET)
				CFG_LoadParam(PUSDATE_BUF, HF_astrParamCfgTblAttr, usStartAddr,usLen, 0x03); //HF参数读取
		memcpy(modbus.modbus_snd_buf,&wm_req,7);
		memcpy(&modbus.modbus_snd_buf[7],PUSDATE_BUF,usLen*2);
		rlen = usLen*2 + 7;
		crc = crc16(modbus.modbus_snd_buf,rlen);
		modbus.modbus_snd_buf[rlen] = crc;
		modbus.modbus_snd_buf[rlen+1] = crc>>8;
		MODBUS_UARTSend(USART1, modbus.modbus_snd_buf, rlen+MODBUS_CRC_LEN);
		SEND_10_FLAG = 1;
	}
	else                            //发送完成，等待接收回复
	{
		Timeout_Cnt++;
		if(Timeout_Cnt > 5)      //防止同逆变器一起上电，导致询问后永远等待逆变器回应
		{
			Timeout_Cnt = 0;
			SEND_10_FLAG = 0;
		}
		if(UART_RX_RUNNING_FLAG == 1)
		{
			cur_cnt = c_1MS_Cnt;
			offset = (cur_cnt>=modbus.prevtime)?(cur_cnt-modbus.prevtime):(0xFFFFFFFF-modbus.prevtime+cur_cnt);
			if(offset < MAX_RCV_PERIOD)
			return;
			//接收完成，判断是否写入成功
			UART_RX_RUNNING_FLAG = 0;
			crc = crc16(modbus.modbus_rcv_buf,modbus.recvlen-MODBUS_CRC_LEN);
			/*CRC校验错误丢弃*/
			RX_CRC = (modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN])|(modbus.modbus_rcv_buf[modbus.recvlen-MODBUS_CRC_LEN+1]<<8);
			if(RX_CRC != crc)
			{
				modbus.recvlen = 0;
				SEND_10_FLAG = 0;
				FLAG_10_UPDATE = 1;
				CRC_Error_Flag = 1;
				return;
			}
			SEND_10_FLAG = 0;
			FINISH_FLAG = 1;
			modbus.recvlen = 0;
		}		
	}
}

